### 파이썬 설치 확인

In [5]:
print("Hello world")

Hello world

In [6]:
import pandas as pd
pd.read_csv("data/train.csv")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
!pwd

/c/myjupyter/titanic

[10분판다스](https://pandas.pydata.org/pandas-docs/stable/10min.html)

In [2]:
1+2

3

In [3]:
3/7

0.42857142857142855

In [4]:
13%5

3

In [5]:
1+2==3

True

In [6]:
1+2==4

False

In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [8]:
s= pd.Series([1,3,5,np.nan,6,8])

In [9]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates= pd.date_range('20171119',periods=6)

In [11]:
dates

DatetimeIndex(['2017-11-19', '2017-11-20', '2017-11-21', '2017-11-22',
               '2017-11-23', '2017-11-24'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df= pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2017-11-19  0.173916 -0.580421  0.094839  1.744242
2017-11-20 -0.686013  0.524186 -0.252939  0.372707
2017-11-21 -0.685150  2.363060 -0.023276  0.154552
2017-11-22  0.823948 -0.559831 -0.955635  1.647986
2017-11-23 -1.020021 -1.852950 -0.586339 -0.592662
2017-11-24 -0.601748  1.249548 -1.897726  0.329281

In [15]:
11%2==0

False

In [16]:
12%2==0 ? 5:3

SyntaxError: invalid syntax (<ipython-input-16-68b8c1933e22>, line 1)

In [17]:
14%2==0 and 14%3 ==0

False

글글

#  커짐

In [46]:
s= pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [19]:
a=3
b=5
a+b

8

In [27]:
a=3
a=a+1
print(a)

a #출력 X
a=a+2
a

4

6

In [28]:
hello world

SyntaxError: invalid syntax (<ipython-input-28-22596363b3de>, line 1)

In [29]:
"hello world"

'hello world'

In [35]:
'a'==48

False

In [34]:
"'Shayne''s Name?"

"'Shayne''s Name?"

In [36]:
1+"2"

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [37]:
'1'+'2'

'12'

In [38]:
"1"+"2"

'12'

In [39]:
1+2

3

##  포맷팅

In [42]:
bananas=5
days=3
"shayne ate {0}  bananas for {1} days".format(bananas,days)

'shayne ate 5  bananas for 3 days'

In [43]:
model_a= 0.987654321
model_b= 0.123456789
"[Accuracy] Model A= {0} Model B= {1}".format(model_a, model_b)

'[Accuracy] Model A= 0.987654321 Model B= 0.123456789'

In [44]:
"[Accuracy] Model A= {0:.3f} Model B= {1:.5f}".format(model_a, model_b)

'[Accuracy] Model A= 0.988 Model B= 0.12346'

In [48]:
df2= pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20171119'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                  'D':np.array([3]*4,dtype='int32'),
                  'E':pd.Categorical(["test","train","test","train"]),
                  'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2017-11-19  1.0  3   test  foo
1  1.0 2017-11-19  1.0  3  train  foo
2  1.0 2017-11-19  1.0  3   test  foo
3  1.0 2017-11-19  1.0  3  train  foo

In [49]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [51]:
df2.cumprod

<bound method DataFrame.cumprod of      A          B    C  D      E    F
0  1.0 2017-11-19  1.0  3   test  foo
1  1.0 2017-11-19  1.0  3  train  foo
2  1.0 2017-11-19  1.0  3   test  foo
3  1.0 2017-11-19  1.0  3  train  foo>

In [52]:
df.head()

                   A         B         C         D
2017-11-19  0.173916 -0.580421  0.094839  1.744242
2017-11-20 -0.686013  0.524186 -0.252939  0.372707
2017-11-21 -0.685150  2.363060 -0.023276  0.154552
2017-11-22  0.823948 -0.559831 -0.955635  1.647986
2017-11-23 -1.020021 -1.852950 -0.586339 -0.592662

In [53]:
df.tail(3)

                   A         B         C         D
2017-11-22  0.823948 -0.559831 -0.955635  1.647986
2017-11-23 -1.020021 -1.852950 -0.586339 -0.592662
2017-11-24 -0.601748  1.249548 -1.897726  0.329281

In [54]:
df.index

DatetimeIndex(['2017-11-19', '2017-11-20', '2017-11-21', '2017-11-22',
               '2017-11-23', '2017-11-24'],
              dtype='datetime64[ns]', freq='D')

####  문자열

In [56]:
message="hello world"
message

In [61]:
message[-2]

'l'

In [62]:
message[0:4]

'hell'

In [68]:
print("H" in message)
print("h" in message)
print("hell" in message)

False
True
True

In [74]:
print(message.upper())
print(message.lower())

HELLO WORLD
hello world

### 리스트

In [76]:
odd=[1,3,5,7,9]
odd

[1, 3, 5, 7, 9]

In [81]:
print(odd[0])
print(odd[-2])
print(odd[1:-1])

1
7
[3, 5, 7]

In [85]:
print(1 in odd)
print(2 in odd)
print(3 in odd)

True
False
True

In [98]:
odd.append(11)
odd= odd+[13,15,17,19]
odd[3]= 11
odd[4]= -1

In [119]:
odd.pop()

11

In [120]:
print(odd)

[1, 3, 7]

In [121]:
message= "Hello World!"
print(message.split(" "))
print(message.split("o"))

['Hello', 'World!']
['Hell', ' W', 'rld!']

In [123]:
words=["Hello","World!"]
print(" ".join(words))
print(",".join(words))
print(", ".join(words))

Hello World!
Hello,World!
Hello, World!

###  제어문

In [127]:
age= 5
if age<5:
    print("아이")
else: 
    print("애어른")

애어른

In [135]:
age= 3

if age<5:
    print("아이")
elif age<18:
    print("학생")
else:
    print("어른")

아이

###  반복문

In [141]:
baskets= ['apple','banana','grape','dragonfruit']
for stuff in baskets:
    print(stuff)
print("-----")
stuff= baskets[0]
print(stuff)
stuff= baskets[1]
print(stuff)
stuff= baskets[2]
print(stuff)
stuff= baskets[3]
print(stuff)

apple
banana
grape
dragonfruit
-----
apple
banana
grape
dragonfruit

In [142]:
for i in range(5):
    print(i)

0
1
2
3
4

In [146]:
for i in range(1,6):
    print(i)

1
2
3
4
5

In [155]:
for i in range(1,6):
    if i==2:
        continue
    elif i==5:
        break
    print(i)

1
3
4

In [168]:
#  0부터 10까지

double_list=[]
# ㄴㄴ for i in range(1,10):
for i in range(1,11):
#     if(i==5):  # 됨
    if i==5:
        continue
    elif i==8:
        break;
    double= i*2
#     ㄴㄴ double_list.append= double
    double_list.append(double)

# print(double_list) # 원하는대로 됨
double_list

[2, 4, 6, 8, 12, 14]

###  함수

In [174]:
#def. define
def multiply(a,b):
    print(a*b)
multiply(2,1900000000000000000)
multiply(-1,0.5)

3800000000000000000
-0.5

In [181]:
def sign(n):
    if n<0:
        print("음수")
    elif n==0:
        print("영")
    else:
        print("양수")

sign(21)

양수

In [184]:
for n in [-1,0,+1]:
        print(n)

-1
0
1

In [183]:
def sign2(n):
    for n in [-1,0,+1]:
        print(n)
sign2

### 팩토리얼

In [190]:
result= 1
n=4
for i in range(1,n):
    result*= i
#   ㄴㄴ  result*= n
print(result)

6

In [192]:
def factorial(n):
    result= 1
    for i in range(1,n+1):
        result*= i
    return result

print(factorial(5))
print(factorial(3))
print(factorial(0))

120
6
1

In [194]:
# for i in reversed(range(1,5)):
for i in reversed(range(1,5)):
    print(i)

4
3
2
1